Repository: Dynamic-Book/DyboApp
Catalog: i18n/po/dybo/*.po
Languages: fr

source: {1}'s Dynabook
fr: Le Dynabook de {1}

source: Back-to-school day
fr: Rentrée scolaire

source: End of school year
fr: Fin des cours

source: Unspecified agenda
fr: Agenda non spécifié

source: {1} to {2}
fr: {1} à {2}

source: class
fr: classe

source: Unknown class
fr: Classe inconnue

source: Number
fr: Numéro

source: lesson
fr: leçon

source: Lessons
fr: Leçons

source: Unnamed course
fr: Cours sans nom

source: Subject
fr: Sujet

source: period
fr: période

source: Periods
fr: Périodes

source: Day
fr: Jour

source: Period(s)
fr: Période(s)

source: Room
fr: Salle

source: day off
fr: jour férié

source: Days off
fr: Jours fériés

source: End
fr: Fin

source: days inteval
fr: intervalle de jours

source: Unknown person
fr: Personne inconnue

source: Firstname
fr: Prénom

source: Lastname
fr: Nom de famille

source: school
fr: école

source: Schools
fr: Ecoles

source: Unknown school
fr: Ecole inconnue

source: School name
fr: Nom d'école

source: student
fr: étudiant

source: Students
fr: Etudiants

source: time slot
fr: créneau horaire

source: Time slots
fr: Créneaux horaires

source: End time
fr: Fin de période

source: End time can't preced start time.
fr: Fin de période avant début de période

source: Name
fr: Nom

source: Start time
fr: Début de période

source: topic
fr: thème

source: Topics
fr: Thèmes

source: Unnamed topic
fr: Thème sans nom

source: Title
fr: Ttire

source: System menu
fr: Menu système

source: The Dybo application for educators and learners to manage their job. {1} {2} LICENSES: - Dybo packages LGPL - Each DKM package is released under the terms of its specific license with possible restrictions.
fr: L'application Dybo pour enseignants et apprenant pour gérer leurs tâches. {1} {2} LICENCES : - Paquets Dybo LGPL - Chaque paquets DKM est sous sa propre licence avec de possibles restrictions

source: You may have unsaved data! Are you sure to quit the Dybo application?
fr: Vous pourriez avoir des données non sauvegardées ! Voulez-vous vraiment quitter l'application Dybo ?

source: A source code browser to view, edit and save Dybo code. Hacker only!
fr: Un navigateur de code source pour voir, éditer et sauver le code de Dybo. Bidouilleur seulement !

source: A window used as a scratchpad area where fragments of Cuis-Smalltalk code can be entered, stored, edited, and evaluated.
fr: Une fenêtre utilisée comme une zone de bloc-notes où des fragments de code Cuis-Smalltalk peuvent être entrés, stockés, édités et évalués.

source: A window used to print information from the code - text output. Any object receiving the message #print is output in the Transcript: 'hello' print, (k * 5) print. Use the Transcript class for more elaborated output.
fr: Une fenêtre utilisée pour afficher des informations depuis le code - sortie texte. N'importe quel objet recevant le message #print est affiché dans le Transcript : ''hello'' print, (k * 5 ) print. Utiliser la classe Transcript pour des sorties texte plus élaborée.

source: Open a file
fr: Ouvrir un fichier

source: Open the filer on your personal models collection.
fr: Ouvrez un fichier de votre collection personnelle de modèles.

source: Save session
fr: Enregister la session

source: Save this Dybo application as it is right now.
fr: Enregistrer l'application Dybo telle qu'elle se présente maintenant.

source: System Browser
fr: Navigateur système

source: Tools
fr: Outils

source: Workspace
fr: Espace de travail

source: Release
fr: Version logiciel

source: About
fr: A-propos

source: New Dybo environment
fr: Nouvel environnement Dybo

source: Open Dybo environent
fr: Ouvrir l'environnement Dybo

source: Quit
fr: Qutter

source: Toggle full screen mode
fr: Basculer en plein écran

source: Turn full screen mode on when it is off, off when it is on.
fr: Basculer entre les modes plein écran et fenêtré, et vis-versa.

source: Delete the document: {1} in the topic: {2}?
fr: Supprimer le document : {1} du thème : {2}

source: No, keep it.
fr: Non, le garder.

source: Yes, I want to delete it.
fr: Oui, je veux l'effacer.

source: Delete the task at {1}?
fr: Supprimer la tâche à {1} ?

source: No
fr: Non

source: Yes
fr: Oui

source: Import a PDF document.
fr: Importer un document PDF.

source: The default model for a new page in a document.
fr: Le model par défaut d'une nouvelle page d'un document.

source: The default ratio of a page document expressed with two numbers in width and ehight.
fr: La proportion par défaut d'une page définie par deux nombres, largeur et hauteur.

source: Future tasks
fr: Tâches futures

source: at
fr: à

source: New task in
fr: Nouvelle tâche dans

source: Save
fr: Enregistrer

source: Delete the task {1}?
fr: Supprimer la tâche {1} ?

source: Create a new document in the selected topic.
fr: Créer un nouveau document dans le thème sélectionné.

source: Import a PDF document in the selected topic.
fr: Importer un document PDF dans le thème sélectionné.

source: My documents
fr: Mes documents

source: Delete this document
fr: Supprimer ce document

source: Edit this document
fr: Editer ce document

source: Save this document
fr: Enregistrer ce document

source: By name
fr: Par nom

source: Newer first
fr: Récent

source: Older first
fr: Ancien

source: Scroll the document to the left or right.
fr: Faire défiler la page à gauche ou à droite.

source: Binders
fr: Classeurs

source: In the Binders, find the documents of your courses and start a new one.
fr: Dans les classeurs, parcourir les documents de tes cours ou en créer un nouveau.

source: Erase with a width of {1} pixels.
fr: Gommer avec une largeur de {1} points.

source: Highlight with a {1} color.
fr: Mettre en évidence avec la couleur {1}.

source: yellow
fr: jaune

source: Highlit with a width of {1} pixels.
fr: Mettre en évidence avec une largeur de {1} points.

source: Write with a width of {1} pixel(s).
fr: Ecrire avec une épaisseur de {1} point(s).

source: Open a blank document to start writing.
fr: Créer un nouveau document et commencer à écrire.

source: Open document
fr: Créer un document

source: Write with a {1} color.
fr: Ecrire avec la couleur {1}.

source: black
fr: noire

source: blue
fr: bleue

source: green
fr: verte

source: red
fr: rouge

source: white
fr: blanche

source: In the Settings, edit your course and student lists.
fr: Dans les réglages, éditer les listes de vos cours et de vos élèves.

source: Settings
fr: Réglages
